student = {
    "name": "Egor", 
    "surname": "Ivanov", 
    "age": 13, 
    "marks": {
        "math": [12, 9, 2, 8],
        "physic": [12, 9, 2, 8],
    }
}

print(student["marks"]["math"])

# 30 
# 1 - 15
"""
10
Вам нужно чтобы пользователь вручную ввел оценки по предметам. 
+ 5 -> Он самостоятельно вібирает предмет или добавляет, и может добавлять неограниченное количество оценок.

15 
Вам нужно посчитать средний балл студента. (Посчитать оценки за предмет и вівести среднюю, а потом уже из єтого сдеать итоговую )
"""